:PROPERTIES:
:ID:       03d6068d-0f88-44f3-8133-b6ee87cbf155
:END:
#+TITLE: Linux: Customize Mouse Memory
#+CATEGORY: slips
#+TAGS:

* Logitech G503

#+name: mouse-name
#+begin_src emacs-lisp :results value
"singing-gundi"
#+end_src

** Profile 0

#+name: ratbag-profile-buttons
#+begin_src sh :results output table :var mouse=mouse-name p=0
ratbagctl $mouse profile $p get \
    | grep -e "^Button:" \
    | sed -E "s/Button: ([0-9]+) is mapped to '(.*)'$/\1	\2/g" \
    | tr ' ' '-' | tr '	' ' '

# requires tab ...
#+end_src

#+RESULTS: ratbag-profile-buttons
|  0 | button-1             |
|  1 | button-2             |
|  2 | button-3             |
|  3 | button-4             |
|  4 | button-5             |
|  5 | resolution-alternate |
|  6 | resolution-down      |
|  7 | resolution-up        |
|  8 | profile-cycle-up     |
|  9 | wheel-right          |
| 10 | wheel-left           |

** Profile 2

#+call: ratbag-profile-buttons(p=2)

#+RESULTS:
|                                                                 0 | button-1         |
|                                                                 1 | button-2         |
|                                                                 2 | button-3         |
|                                                                 3 | button-4         |
|                                                                 4 | button-5         |
|                                                                 5 | second-mode      |
| Button:-6-is-mapped-to-macro-'↓KEY_LEFTCTRL-↕KEY_C-↑KEY_LEFTCTRL' |                  |
| Button:-7-is-mapped-to-macro-'↓KEY_LEFTCTRL-↕KEY_V-↑KEY_LEFTCTRL' |                  |
|                                                                 8 | profile-cycle-up |
|                                                                 9 | wheel-right      |
|                                                                10 | wheel-left       |


** Profile 3

#+call: ratbag-profile-buttons(p=3)

#+RESULTS:
|  0 | button-1             |
|  1 | button-2             |
|  2 | button-3             |
|  3 | button-4             |
|  4 | button-5             |
|  5 | resolution-alternate |
|  6 | resolution-down      |
|  7 | resolution-up        |
|  8 | profile-cycle-up     |
|  9 | wheel-right          |
| 10 | wheel-left           |


** Profile 4

#+call: ratbag-profile-buttons(p=1)

#+RESULTS:
|  0 | button-1             |
|  1 | button-2             |
|  2 | button-3             |
|  3 | button-4             |
|  4 | button-5             |
|  5 | resolution-alternate |
|  6 | resolution-down      |
|  7 | resolution-up        |
|  8 | profile-cycle-up     |
|  9 | wheel-right          |
| 10 | wheel-left           |


* Roam
